using System.Collections;
using System.Collections.Generic;
using UnityEngine;

// Класс - головний контейнер скрипта
public class Spargalka : MonoBehaviour
{
    // Ціле число "int" зі значенням 12
    // private  - модифікатор доступу до змінної age.
    // забороняє відображення змінної в редакторі Unity та ін. скриптах
    private int age = 12;

    // Дробове число "float" зі значенням 1.58
    // "f" - вказівка на тип даних "float"
    // public - дає можливість бачити змінну у редакторі Unity
    // та у екземплярах об'єкту класса
    public float height = 1.58f;

    // Строка тексту "string" зі значенням "Ноунейм"
    // static - дає можливість змінювати значення у всіх екземплярах
    // і звертатися до змінної через Класс
    public static string name = "Ноунейм";

    // Логічний тип даних "bool"
    // Приймає тільки 2 значення = "true" або "false"
    private bool logic = false;

    // Виконується один раз, коли екземпляр об'єкту з'являється
    // на сцені. Ключове слово "void" вказує на те, що ніякі данні
    // не повинні повертатися ключовим словом "return"
    private void Start()
    // Start - вбудована функція
    {
        // Умовні оператори
        if (logic) // Перевіряє умову
        {
            // Код виконується, якщо умова повертає логічне "true"
        }
        // Перевіряє наступну умову якщо if не є "true"
        // знак "!" перед умовою інвертує її логічне значення
        // В нашому випадку, змінює "logic = false" на "logic = true"
        else if (!logic)
        {
            // Код
        }
        // Виконується, коли жодна з умов не є дійсною, тобто "true"
        else
        {
            // Код
        }

        //  Порівняльні оператори

        if (1 < 2) { } // < - Менше ніж
        if (1 > 2) { } // > - Більше ніж
        if (1 <= 2) { } // <= - Менше або дорівнює
        if (1 >= 2) { } // >= - Більше або дорівнює
        if (1 == 2) { } // == - Дорівнює
        if (1 != 2) { } // != - Не дорівнює

        // Виконується якщо всі вказані умови вірні
        if (1 < 2 && logic) { } // && - логічне "та/і"
        // Виконується якщо вірна хоча б одна умова
        if (1 < 2 || logic) { } // || - логічне "або"

        // Альтернатива оператору if, перевіряє стан однієї змінної
        switch (age)
        {
            case 12: // Порівнює "age" з числом "12"
                // Код
                break;
            case 13:
                // Код
                break;
            default: // Виконується, якщо жодне зі значень не підійшло
                // Код
                break;
        }
    }
}
